#include <iostream>
using namespace std;
//Операторы
//Унарные
//Бинарные
//Тернарные

int main()
{
	//унарный пример
	int a = -5;
	cout << a << endl; // переменная а = -5
	a = -a;
	cout << a << endl; // переменная а = 5

	/*
		бинарные это 
			сложение 5+5 
			выичитание 5-5
			умножение 5*5
			деление 5/5
			деление по модулю 5%5
		так же есть кроме арифмитических есть 
		операции равенство 
			равен ==
			не равен !=
		+ еще есть 
		операции сравнение 
		меньше <
		больше >
		меньше или равно <=
		больше или равно >=
	*/
}